#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_service_account.thanos: Refreshing state... [id=projects/raspbernetes/serviceAccounts/100870865833557748838]
google_storage_bucket.thanos: Refreshing state... [id=thanos-raspbernetes-storage]
google_kms_key_ring.sops: Refreshing state... [id=projects/raspbernetes/locations/global/keyRings/sops]
google_service_account.velero: Refreshing state... [id=projects/raspbernetes/serviceAccounts/103212170248515258400]
google_storage_bucket.velero: Refreshing state... [id=raspbernetes-velero-backups]
google_project_iam_custom_role.velero: Refreshing state... [id=projects/raspbernetes/roles/velero]
google_project_iam_custom_role.thanos: Refreshing state... [id=projects/raspbernetes/roles/thanos]
google_kms_key_ring_iam_binding.sops: Refreshing state... [id=projects/raspbernetes/locations/global/keyRings/sops/roles/cloudkms.cryptoKeyDecrypter]
google_kms_crypto_key.sops: Refreshing state... [id=global/sops/sops-key]
google_project_iam_binding.velero: Refreshing state... [id=raspbernetes/projects/raspbernetes/roles/velero]
google_project_iam_binding.thanos: Refreshing state... [id=raspbernetes/projects/raspbernetes/roles/thanos]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_kms_key_ring_iam_binding.sops must be replaced
-/+ resource "google_kms_key_ring_iam_binding" "sops" {
      ~ etag        = "BwW0dETzQbI=" -> (known after apply)
      ~ id          = "projects/raspbernetes/locations/global/keyRings/sops/roles/cloudkms.cryptoKeyDecrypter" -> (known after apply)
        key_ring_id = "projects/raspbernetes/locations/global/keyRings/sops"
        members     = [
            "user:saurabh.c.pandit@gmail.com",
        ]
      ~ role        = "roles/cloudkms.cryptoKeyDecrypter" -> "projects/raspbernetes/roles/sops" # forces replacement
    }

  # google_project_iam_custom_role.sops will be created
  + resource "google_project_iam_custom_role" "sops" {
      + deleted     = (known after apply)
      + description = "This role grants all required SOPS permissions"
      + id          = (known after apply)
      + name        = (known after apply)
      + permissions = [
          + "cloudkms.cryptoKeyVersions.get",
          + "cloudkms.cryptoKeyVersions.list",
          + "cloudkms.cryptoKeyVersions.useToDecrypt",
          + "cloudkms.cryptoKeyVersions.useToEncrypt",
          + "cloudkms.cryptoKeyVersions.viewPublicKey",
          + "cloudkms.cryptoKeys.get",
          + "cloudkms.cryptoKeys.list",
          + "cloudkms.keyRings.get",
          + "cloudkms.keyRings.list",
          + "resourcemanager.projects.get",
        ]
      + project     = (known after apply)
      + role_id     = "sops"
      + stage       = "GA"
      + title       = "SOPS Role"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @xUnholy, Action: `pull_request`, Working Directory: `infrastructure/gcp`, Workflow: `terraform`*